In [1]:
import pandas as pd

filepath = "./data/u.data"
df = pd.read_csv(filepath, sep="\t", header=None)
df.columns = ["user_id", "item_id", "rating", "timestamp"]
df.head()

   user_id  item_id  rating  timestamp
0      196      242       3  881250949
1      186      302       3  891717742
2       22      377       1  878887116
3      244       51       2  880606923
4      166      346       1  886397596

In [9]:
df.shape

(100000, 4)

In [10]:
print(pd.unique(df["user_id"]).shape[0])
df['user_id'].value_counts()

943

user_id
405    737
655    685
13     636
450    540
276    518
      ...
441     20
36      20
812     20
895     20
93      20
Name: count, Length: 943, dtype: int64

In [ ]:
pd.unique(df["rating"])

array([3, 1, 2, 4, 5])

In [11]:
# Convert 'timestamp' to a human-readable datetime format
df['timestamp'] = pd.to_datetime(df['timestamp'], unit='s')

In [12]:
df

       user_id  item_id  rating           timestamp
0          196      242       3 1997-12-04 15:55:49
1          186      302       3 1998-04-04 19:22:22
2           22      377       1 1997-11-07 07:18:36
3          244       51       2 1997-11-27 05:02:03
4          166      346       1 1998-02-02 05:33:16
...        ...      ...     ...                 ...
99995      880      476       3 1997-11-22 05:10:44
99996      716      204       5 1997-11-17 19:39:03
99997      276     1090       1 1997-09-20 22:49:55
99998       13      225       2 1997-12-17 22:52:36
99999       12      203       3 1997-11-19 17:13:03

[100000 rows x 4 columns]

In [14]:

# 時間帯を分類する関数を定義
def classify_time_of_day(hour):
    if 0 <= hour < 5:
        return 'Late Night'
    elif 5 <= hour < 10:
        return 'Morning'
    elif 10 <= hour < 15:
        return 'Afternoon'
    elif 15 <= hour < 19:
        return 'Evening'
    elif 19 <= hour < 24:
        return 'Night'
    else:
        return 'Unknown'

# 'timestamp' から時間帯を取得
df['time_of_day'] = df['timestamp'].dt.hour.apply(classify_time_of_day)

# 結果を確認
print(df[['timestamp', 'time_of_day']].head())

            timestamp time_of_day
0 1997-12-04 15:55:49     Evening
1 1998-04-04 19:22:22       Night
2 1997-11-07 07:18:36     Morning
3 1997-11-27 05:02:03     Morning
4 1998-02-02 05:33:16     Morning

In [15]:
df

       user_id  item_id  rating           timestamp time_of_day
0          196      242       3 1997-12-04 15:55:49     Evening
1          186      302       3 1998-04-04 19:22:22       Night
2           22      377       1 1997-11-07 07:18:36     Morning
3          244       51       2 1997-11-27 05:02:03     Morning
4          166      346       1 1998-02-02 05:33:16     Morning
...        ...      ...     ...                 ...         ...
99995      880      476       3 1997-11-22 05:10:44     Morning
99996      716      204       5 1997-11-17 19:39:03       Night
99997      276     1090       1 1997-09-20 22:49:55       Night
99998       13      225       2 1997-12-17 22:52:36       Night
99999       12      203       3 1997-11-19 17:13:03     Evening

[100000 rows x 5 columns]

In [17]:
df.isna().sum()

user_id        0
item_id        0
rating         0
timestamp      0
time_of_day    0
dtype: int64

In [ ]:
df.to_csv(".data/u_transformed.csv", index=False)

In [2]:
temp = pd.unique(df['user_id'])
temp = sorted(temp)

print(len(temp))
# print(df['user_id'].value_counts())

print(max(temp), min(temp))

for i, j in enumerate(temp):
    if i+1 != j:
        print(i, j)

943
943 1

In [3]:
temp = pd.unique(df['item_id'])
temp = sorted(temp)

print(len(temp))
# print(df['user_id'].value_counts())

print(max(temp), min(temp))

for i, j in enumerate(temp):
    if i+1 != j:
        print(i, j)

1682
1682 1

In [4]:
df['rating'].value_counts()

rating
4    34174
3    27145
5    21201
2    11370
1     6110
Name: count, dtype: int64

In [ ]:
from tensorly.decomposition import parafac
from tensorly.cp_tensor import cp_to_tensor

In [6]:
import numpy as np
np.random.rand(3, 3, 3)

array([[[0.90528307, 0.24146202, 0.77916985],
        [0.61180648, 0.43530249, 0.4796402 ],
        [0.42457728, 0.018019  , 0.73234643]],

       [[0.95409972, 0.88319684, 0.79972363],
        [0.68694525, 0.81852326, 0.86416165],
        [0.81605411, 0.65131787, 0.79076667]],

       [[0.66858765, 0.93488766, 0.44630126],
        [0.00641497, 0.62600737, 0.79685538],
        [0.25162036, 0.09108888, 0.75856495]]])

In [1]:
import sparse

In [2]:
943 * 1682 * 5 - 7830630

100000

In [3]:
7830630 / (943 * 1682 * 5)

0.987390661271551

In [2]:
943 * 1682 * 5

7930630